esch/STM32L052-examples/STM32_nrf/nRF/nRF24L01P_Maniacbug.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */
// #include "mbed.h" 
#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/cm3/nvic.h>
#include <libopencm3/stm32/flash.h>
#include <libopencm3/stm32/spi.h>

#include "nRF24L01P_Maniacbug.h"
#include "stdio.h" 
#include "string.h" 
#include "stm32_nrf.h"

char *strDR[3] = { "1MBPS", "2MBPS" , "250kBPS" };
char *strCRC[3] = { "RF24_CRC_DISABLED", "RF24_CRC_8" , "RF24_CRC_16" };


#ifdef LATER
#define PIN_SPI_MOSI               GPIO7      //
#define PORT_SPI_MOSI              GPIOA

#define PIN_SPI_MISO               GPIO6      
#define PORT_SPI_MISO              GPIOA

#define PIN_SPI_CLK               GPIO5      //SCK = PE12
#define PORT_SPI_CLK              GPIOA

#define PIN_SPI_CE                GPIO3     //
#define PORT_SPI_CE               GPIOA

#define PIN_SPI_CSN               GPIO4      //
#define PORT_SPI_CSN              GPIOA
#endif

#define PIN_SPI_MOSI               GPIO5      //
#define PORT_SPI_MOSI              GPIOB

#define PIN_SPI_MISO               GPIO4      
#define PORT_SPI_MISO              GPIOB

#define PIN_SPI_CLK               GPIO3      //SCK 
#define PORT_SPI_CLK              GPIOB

#define PIN_SPI_CE                GPIO6     //
#define PORT_SPI_CE               GPIOA

#define PIN_SPI_CSN               GPIO15      //
#define PORT_SPI_CSN              GPIOA
/****************************************************************************/

// RF24::RF24(PinName mosi, PinName miso, PinName sck, PinName _csnpin, PinName _cepin):
RF24::RF24():
   wide_band(true), p_variant(false), 
  payload_size(32), ack_payload_available(false), dynamic_payloads_enabled(false),
  pipe0_reading_address(0)
{
	 // ce_pin.init(_cepin);
	 // csn_pin.init(_csnpin);



  // print("spi init ",12);
  // spi(mosi, miso, sck);
		
  //   spi.frequency(10000000/5);     // 2Mbit, 1/5th the maximum transfer rate for the spi bus
  //   spi.format(8,1);                                   // 8-bit, ClockPhase = 0, ClockPolarity = 0
}


/****************************************************************************/

void RF24::csn(int mode)
{

if(mode)
   gpio_set(PORT_SPI_CSN,PIN_SPI_CSN);
else 
   gpio_clear(PORT_SPI_CSN,PIN_SPI_CSN);
    // csn_pin = mode;
    
}

/****************************************************************************/

void RF24::ce(int level)
{

  if(level)
   gpio_set(PORT_SPI_CE,PIN_SPI_CE);
  else 
   gpio_clear(PORT_SPI_CE,PIN_SPI_CE);
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
  // uint8_t status;

  csn(LOW);
  // status = spi.write( R_REGISTER | ( REGISTER_MASK & reg ) );
   spi_send8_sw(SPI1, R_REGISTER | ( REGISTER_MASK & reg ) );
   spi_read8_sw(SPI1);

  while ( len-- ) {
    spi_send8_sw(SPI1,0xff);
    *buf++ = spi_read8_sw(SPI1);
  }
    // *buf++ = spi.write(0xff);

  csn(HIGH);

  return 0;
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg)
{
  csn(LOW);
  // spi.write( R_REGISTER | ( REGISTER_MASK & reg ) );

  spi_send8_sw(SPI1, R_REGISTER | ( REGISTER_MASK & reg ));
  spi_read8_sw(SPI1);
  spi_send8_sw(SPI1, 0xff);
  uint8_t result = spi_read8_sw(SPI1);

  // uint8_t result = spi.write(0xff);

  csn(HIGH);
  return result;
}


uint8_t RF24::read_register_x(uint8_t reg)
{
  csn(LOW);
  // spi.write( R_REGISTER | ( REGISTER_MASK & reg ) );

  spi_send8_sw(SPI1, R_REGISTER | ( REGISTER_MASK & reg ));
  spi_read8_sw(SPI1);
  spi_send8_sw(SPI1, 0xff);
  uint8_t result = spi_read8_sw(SPI1);

  // uint8_t result = spi.write(0xff);

  csn(HIGH);
  return result;
}
/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
  // uint8_t status;

  csn(LOW);
  // status = spi.write(  );
    spi_send8_sw(SPI1, W_REGISTER | ( REGISTER_MASK & reg ));
  while ( len-- )
      spi_send8_sw(SPI1, *buf++);

    // spi.write(*buf++);

  csn(HIGH);

  return 0;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, uint8_t value)
{
  // uint8_t status;

//  IF_SERIAL_DEBUG(printf(("write_register(%02x,%02x)\r\n"),reg,value));

  csn(LOW);
  // status = spi.write( W_REGISTER | ( REGISTER_MASK & reg ) );
   spi_send8_sw(SPI1, W_REGISTER | ( REGISTER_MASK & reg ) );
   spi_send8_sw(SPI1, value);

  csn(HIGH);

  return 0;
}

/****************************************************************************/

uint8_t RF24::write_payload(void* buf, uint8_t len)
{
  // uint8_t status;

  // const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);
  // const uint8_t* current = (uint8_t *)buf;

  uint8_t *reg = (uint8_t *)buf;

  uint8_t data_len = min(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  

  // print_s_decimal("write_payload blanks ",data_len);
  // print_s_decimal("write_payload blanks size",payload_size);
  //printf("[Writing %u bytes %u blanks]",data_len,blank_len);
  
  csn(LOW);
  // status = spi.write( W_TX_PAYLOAD );
   spi_send8_sw(SPI1, W_TX_PAYLOAD);
  while ( data_len-- )
     spi_send8_sw(SPI1,*reg++);

  while ( blank_len-- )
   spi_send8_sw(SPI1, 0x1);    
    // spi.write(0);
  csn(HIGH);

  return 0;
}

/****************************************************************************/

uint8_t RF24::read_payload(void* buf, uint8_t len)
{
  // uint8_t status;
  uint8_t* current = reinterpret_cast<uint8_t*>(buf);

  uint8_t data_len = min(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  
  //printf("[Reading %u bytes %u blanks]",data_len,blank_len);
  
  csn(LOW);
   spi_send8_sw(SPI1, R_RX_PAYLOAD);
   spi_read8_sw(SPI1);
  while ( data_len-- ) {
    spi_send8_sw(SPI1,0xff);
    *current++ = spi_read8_sw(SPI1);
    }
  while ( blank_len-- )
   spi_send8_sw(SPI1, 0xff);    

  csn(HIGH);

