esch/STM32L052-examples/STM32_nrf/nRF/nRF24L01P_Maniacbug.cpp
  return 0;
}

/****************************************************************************/

uint8_t RF24::flush_rx(void)
{
  // uint8_t status;

  csn(LOW);
  spi_send8_sw(SPI1, FLUSH_RX);
  // status = spi.write( FLUSH_RX );
  csn(HIGH);

  // return status;
  return 0;
}

/****************************************************************************/

uint8_t RF24::flush_tx(void)
{
  // uint8_t status;

  csn(LOW);
  spi_send8_sw(SPI1, FLUSH_TX);
  // status = spi.write( FLUSH_TX );
  csn(HIGH);

  // return status;
  return 0;
}

/****************************************************************************/

uint8_t RF24::get_status(void)
{
  // uint8_t status;

  // csn(LOW);
  // spi_send8_sw(SPI1, NOP);
  // // status = spi.write( NOP );
  // csn(HIGH);

  // return status;
  return read_register(STATUS );
}

/****************************************************************************/

void RF24::print_status(uint8_t status)
{

  print("STATUS = "); print_hex8(status);
  print(" RX_DR = ");  print_hex8( (status & _BV(RX_DR))?1:0);
  print(" TX_DR = ");  print_hex8( (status & _BV(TX_DS))?1:0);
  print(" MAX_RT = "); print_hex8( (status & _BV(MAX_RT))?1:0);
  print(" RX_P_NO = "); print_hex8( ((status >> RX_P_NO) & 7)) ;
  print(" TX_FULL = "); print_hex8( (status & _BV(TX_FULL))?1:0 );

  print("\r\n");
}

/****************************************************************************/
#ifdef LATER

void RF24::print_observe_tx(uint8_t value)
{
#ifdef  LATER
  printf(("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"),
           value,
           (value >> PLOS_CNT) & 15,
           (value >> ARC_CNT) & 15
          );
#endif
}

/****************************************************************************/
#endif

void RF24::print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
//  char extra_tab = strlen(name) < 8 ? '\t' : 0;
  print((char *)name);
  print(" = ");
  while (qty--) {
     // printf((" 0x%02x"),read_register(reg++));
     print_hex8(read_register(reg++));
     print(" ");
   }

  print("\r\n");
}

/****************************************************************************/

void RF24::print_address_register(const char* name, uint8_t reg, uint8_t qty)
{
//  char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  print((char *)name);
  print(" = ");

  while (qty--)
  {
    uint8_t buffer[5];
    read_register(reg++,buffer,sizeof buffer);

    // print(" 0x");
    uint8_t* bufptr = buffer + sizeof buffer;
    while( --bufptr >= buffer ) {
          // print("0x");
          print_hex8(*bufptr);
          print(" ");
      }
    print("- ");  
  }

  print("\r\n");
}


/****************************************************************************/

void RF24::setChannel(uint8_t channel)
{
  // TODO: This method could take advantage of the 'wide_band' calculation
  // done in setChannel() to require certain channel spacing.
  print_s_decimal("setChannel ",channel);

  const uint8_t max_channel = 127;
  write_register(RF_CH,min(channel,max_channel));
}

/****************************************************************************/

void RF24::setPayloadSize(uint8_t size)
{
  const uint8_t max_payload_size = 32;
  payload_size = min(size,max_payload_size);
}

/****************************************************************************/

uint8_t RF24::getPayloadSize(void)
{
  return payload_size;
}

/****************************************************************************/

static const char rf24_datarate_e_str_0[]  = "1MBPS";
static const char rf24_datarate_e_str_1[]  = "2MBPS";
static const char rf24_datarate_e_str_2[]  = "250KBPS";
static const char * const rf24_datarate_e_str_P[]  = {
  rf24_datarate_e_str_0,
  rf24_datarate_e_str_1,
  rf24_datarate_e_str_2,
};
static const char rf24_model_e_str_0[]  = "nRF24L01";
static const char rf24_model_e_str_1[]  = "nRF24L01+";
static const char * const rf24_model_e_str_P[]  = {
  rf24_model_e_str_0,
  rf24_model_e_str_1,
};
static const char rf24_crclength_e_str_0[]  = "Disabled";
static const char rf24_crclength_e_str_1[]  = "8 bits";
static const char rf24_crclength_e_str_2[]  = "16 bits" ;
static const char * const rf24_crclength_e_str_P[]  = {
  rf24_crclength_e_str_0,
  rf24_crclength_e_str_1,
  rf24_crclength_e_str_2,
};
static const char rf24_pa_dbm_e_str_0[]  = "PA_MIN";
static const char rf24_pa_dbm_e_str_1[]  = "PA_LOW";
static const char rf24_pa_dbm_e_str_2[]  = "PA_MED";
static const char rf24_pa_dbm_e_str_3[]  = "PA_HIGH";
static const char * const rf24_pa_dbm_e_str_P[]  = { 
  rf24_pa_dbm_e_str_0,
  rf24_pa_dbm_e_str_1,
  rf24_pa_dbm_e_str_2,
  rf24_pa_dbm_e_str_3,
};

void RF24::printDetails(void)
{
  print_status(get_status());

  print_address_register(("RX_ADDR_P0-1"),RX_ADDR_P0,2);
  print_byte_register(("RX_ADDR_P2-5"),RX_ADDR_P2,4);
  print_address_register(("TX_ADDR"),TX_ADDR);

  print_byte_register(("RX_PW_P0-6"),RX_PW_P0,6);
  print_byte_register(("EN_AA"),EN_AA);
  print_byte_register(("EN_RXADDR"),EN_RXADDR);
  print_byte_register(("RF_CH"),RF_CH);
  print_byte_register(("RF_SETUP"),RF_SETUP);
  print_byte_register(("CONFIG"),CONFIG);
  print_byte_register(("DYNPD/FEATURE"),DYNPD,2);

#ifdef  LATER
  printf(("Data Rate\t = %s\r\n"), rf24_datarate_e_str_P[getDataRate()]);
  printf(("Model\t\t = %s\r\n"), rf24_model_e_str_P[isPVariant()]);
  printf(("CRC Length\t = %s\r\n"),rf24_crclength_e_str_P[getCRCLength()]);
  printf(("PA Power\t = %s\r\n"),rf24_pa_dbm_e_str_P[getPALevel()]);
#endif
}

/****************************************************************************/

void RF24::begin(void)
{
  // Initialize pins
//  pinMode(ce_pin,OUTPUT);
//  pinMode(csn_pin,OUTPUT);

  // Initialize spi bus
  //spi.begin();
  // esch ??????
  // mainTimer.start();

	// ce_pin = 0;
  rcc_periph_clock_enable(RCC_SPI1);
      rcc_periph_clock_enable(RCC_GPIOB);


  char sss[12] = "begin \r\n";


