esch/STM32L052-examples/STM32_nrf/nRF/nRF24L01P_Maniacbug.cpp
  gpio_mode_setup(PORT_SPI_CSN, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, PIN_SPI_CSN);    // NSS
  gpio_set(PORT_SPI_CSN, PIN_SPI_CSN);
  gpio_clear(PORT_SPI_CSN, PIN_SPI_CSN);
  gpio_set(PORT_SPI_CSN, PIN_SPI_CSN);

  gpio_mode_setup(PORT_SPI_CE, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, PIN_SPI_CE);    // NSS
  gpio_set(PORT_SPI_CE,PIN_SPI_CE);

// SPI
  gpio_mode_setup(PORT_SPI_MOSI, GPIO_MODE_AF, GPIO_PUPD_NONE,     PIN_SPI_MOSI );
  gpio_mode_setup(PORT_SPI_MISO, GPIO_MODE_AF, GPIO_PUPD_PULLUP,  PIN_SPI_MISO );
  gpio_mode_setup(PORT_SPI_CLK,  GPIO_MODE_AF, GPIO_PUPD_PULLUP,  PIN_SPI_CLK  );
  gpio_set_af(PORT_SPI_CLK, GPIO_AF0,    PIN_SPI_CLK | PIN_SPI_MISO | PIN_SPI_MOSI );



  spi_set_master_mode(SPI1);

  spi_set_baudrate_prescaler(SPI1, SPI_CR1_BR_FPCLK_DIV_2);
  spi_set_clock_polarity_0(SPI1);
  // spi_set_clock_polarity_1(SPI1);
  spi_set_clock_phase_0(SPI1);
  // spi_set_clock_phase_1(SPI1);
  spi_send_lsb_first(SPI1);


  spi_set_full_duplex_mode(SPI1);
  spi_set_unidirectional_mode(SPI1); /* bidirectional but in 3-wire */
  // spi_set_data_size(SPI1, SPI_CR2_DS_8BIT);

  // spi_enable_software_slave_management(SPI1);
  spi_enable_ss_output(SPI1);
  
  spi_fifo_reception_threshold_8bit(SPI1);
  // SPI_I2SCFGR(SPI1) &= ~SPI_I2SCFGR_I2SMOD;
  spi_enable(SPI1);

	
  ce(LOW);

  csn(HIGH);
  // Must allow the radio time to settle else configuration bits will not necessarily stick.
  // This is actually only required following power up but some settling time also appears to
  // be required after resets too. For full coverage, we'll always assume the worst.
  // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
  // Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
  // WARNING: wait_ms is based on P-variant whereby non-P *may* require different timing.
  // wait_ms( 5 ) ;

     // for(int x=0;x<100;x++)
     //  __asm__("nop");



  // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
  // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
  // sizes must never be used. See documentation for a more complete explanation.

  write_register(SETUP_RETR,(4 << ARD) | (15 << ARC));

  // read_register_x(FEATURE);
  // write_register(FEATURE,0x4 );
  // read_register_x(FEATURE);

  // for(int x=0;x<8;x++)
  //   usart_send_blocking(USART1, sss[x]);



  // Restore our default PA level
  setPALevel( RF24_PA_MAX ) ;
// #ifdef LATER

  // Determine if this is a p or non-p RF24 module and then
  // reset our data rate back to default value. This works
  // because a non-P variant won't allow the data rate to
  // be set to 250Kbps.
  if( setDataRate( RF24_250KBPS ) )
  {
    p_variant = true ;
  }
  
  // Then set the data rate to the slowest (and most reliable) speed supported by all
  // hardware.
  setDataRate( RF24_1MBPS ) ;

  // Initialize CRC and request 2-byte (16bit) CRC
  setCRCLength( RF24_CRC_8 ) ;
  
  // Disable dynamic payloads, to match dynamic_payloads_enabled setting
  write_register(DYNPD,0);

  // Reset current status
  // Notice reset and flush is the last thing we do
  write_register(STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

  // Set up default configuration.  Callers can always change it later.
  // This channel should be universally safe and not bleed over into adjacent
  // spectrum.
  setChannel(76);

  // Flush buffers
  flush_rx();
  flush_tx();
  
  // set EN_RXADDRR to 0 to fix pipe 0 from receiving
  write_register(EN_RXADDR, 0);
// #endif	
}

/****************************************************************************/

void RF24::startListening(void)
{
  write_register(CONFIG, read_register(CONFIG) | _BV(PWR_UP) | _BV(PRIM_RX));
  write_register(STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

  // Restore the pipe0 adddress, if exists
  if (pipe0_reading_address)
    write_register(RX_ADDR_P0, reinterpret_cast<const uint8_t*>(&pipe0_reading_address), 5);

  // Flush buffers
  flush_rx();
  flush_tx();

  // Go!
  ce(HIGH);

  // wait for the radio to come up (130us actually only needed)
//  wait_msMicroseconds(130);
    // wait_us(130);
   for(int x=0;x<1000;x++)
      __asm__("nop");


}

/****************************************************************************/

void RF24::stopListening(void)
{
  // esch why take ce low ? 
  ce(LOW);
  flush_tx();
  flush_rx();
}

/****************************************************************************/

void RF24::powerDown(void)
{
  write_register(CONFIG,read_register(CONFIG) & ~_BV(PWR_UP));
}

/****************************************************************************/

void RF24::powerUp(void)
{
  write_register(CONFIG,read_register(CONFIG) | _BV(PWR_UP));
}

/******************************************************************/

bool RF24::write( void* buf, uint8_t len )
{
  bool result = false;

  // Begin the write
  startWrite(buf,len);

  // ------------
  // At this point we could return from a non-blocking write, and then call
  // the rest after an interrupt

  // Instead, we are going to block here until we get TX_DS (transmission completed and ack'd)
  // or MAX_RT (maximum retries, transmission failed).  Also, we'll timeout in case the radio
  // is flaky and we get neither.

  // IN the end, the send should be blocking.  It comes back in 60ms worst case, or much faster
  // if I tighted up the retry logic.  (Default settings will be 1500us.
  // Monitor the send
  uint8_t observe_tx;
  uint8_t status;
  
//esch to be done  uint32_t sent_at = mainTimer.read_ms();

  // const uint32_t timeout = 500; //ms to wait for timeout
   uint32_t timeout = 10; //ms to wait for timeout
  do
  {
    status = read_register(OBSERVE_TX,&observe_tx,1);
   // IF_SERIAL_DEBUG(Serial.print(observe_tx,HEX));
// review !!! we still go into timeout !!!!
   // print_s_hex8("write : ",observe_tx);
  }
   while( ! ( status & ( _BV(TX_DS) | _BV(MAX_RT) ) ) &&  timeout--  );
   // while( ! ( status & ( _BV(TX_DS) | _BV(MAX_RT) ) ) && ( mainTimer.read_ms() - sent_at < timeout ) );

  // The part above is what you could recreate with your own interrupt handler,
  // and then call this when you got an interrupt
  // ------------

  // Call this when you get an interrupt
  // The status tells us three things
  // * The send was successful (TX_DS)
  // * The send failed, too many retries (MAX_RT)
  // * There is an ack packet waiting (RX_DR)
  bool tx_ok, tx_fail;
  whatHappened(tx_ok,tx_fail,ack_payload_available);
  
  //printf("%u%u%u\r\n",tx_ok,tx_fail,ack_payload_available);

  result = tx_ok;
//  IF_SERIAL_DEBUG(Serial.print(result?"...OK.":"...Failed"));

  // Handle the ack packet
  if ( ack_payload_available )
  {
    ack_payload_length = getDynamicPayloadSize();
//    IF_SERIAL_DEBUG(Serial.print("[AckPacket]/"));
//    IF_SERIAL_DEBUG(Serial.println(ack_payload_length,DEC));
  }

